BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_Control.c
/***************************************************************************//**
* \file `$INSTANCE_NAME`_Control.c
* \version `$CY_MAJOR_VERSION`.`$CY_MINOR_VERSION`
*
* \brief
* This file provides the source code to the Control module API of the Component.
*
* \see CapSense v`$CY_MAJOR_VERSION`.`$CY_MINOR_VERSION` Datasheet
*
*//*****************************************************************************
* Copyright (2016-2017), Cypress Semiconductor Corporation.
********************************************************************************
* This software is owned by Cypress Semiconductor Corporation (Cypress) and is
* protected by and subject to worldwide patent protection (United States and
* foreign), United States copyright laws and international treaty provisions.
* Cypress hereby grants to licensee a personal, non-exclusive, non-transferable
* license to copy, use, modify, create derivative works of, and compile the
* Cypress Source Code and derivative works for the sole purpose of creating
* custom software in support of licensee product to be used only in conjunction
* with a Cypress integrated circuit as specified in the applicable agreement.
* Any reproduction, modification, translation, compilation, or representation of
* this software except as specified above is prohibited without the express
* written permission of Cypress.
*
* Disclaimer: CYPRESS MAKES NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, WITH
* REGARD TO THIS MATERIAL, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
* Cypress reserves the right to make changes without further notice to the
* materials described herein. Cypress does not assume any liability arising out
* of the application or use of any product or circuit described herein. Cypress
* does not authorize its products for use as critical components in life-support
* systems where a malfunction or failure may reasonably be expected to result in
* significant injury to the user. The inclusion of Cypress' product in a life-
* support systems application implies that the manufacturer assumes all risk of
* such use and in doing so indemnifies Cypress against all charges. Use may be
* limited by and subject to the applicable Cypress software license agreement.
*******************************************************************************/

#include "syslib/cy_syslib.h"
#include "syspm/cy_syspm.h"
#include "cyfitter_sysint_cfg.h"
#include "`$INSTANCE_NAME`_Configuration.h"
#include "`$INSTANCE_NAME`_Structure.h"
#include "`$INSTANCE_NAME`_Control.h"
#include "`$INSTANCE_NAME`_Processing.h"
#include "`$INSTANCE_NAME`_Filter.h"
#include "`$INSTANCE_NAME`_Sensing.h"
#include "`$INSTANCE_NAME`_Tuner.h"

#if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_SELF_TEST_EN)
    #include "`$INSTANCE_NAME`_SelfTest.h"
#endif

#if (0u != `$INSTANCE_NAME`_ADC_EN)
    #include "`$INSTANCE_NAME`_Adc.h"
#endif /* (0u != `$INSTANCE_NAME`_ADC_EN) */

/***********************************************************************************************************************
* Local definition
***********************************************************************************************************************/
#define `$INSTANCE_NAME`_INIT_DONE   (1u)
#define `$INSTANCE_NAME`_INIT_NEEDED (0u)

/***********************************************************************************************************************
* Local variables
***********************************************************************************************************************/
static uint8 `$INSTANCE_NAME`_InitVar = `$INSTANCE_NAME`_INIT_NEEDED;

/***********************************************************************************************************************
* Local function
***********************************************************************************************************************/
static cy_en_syspm_status_t `$INSTANCE_NAME`_SwitchPowerModeCallback(cy_stc_syspm_callback_params_t *callbackParams);

/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_Start
****************************************************************************//**
*
* \brief
*  Initializes the component hardware and firmware modules. This function is
*  called by the application program prior to calling any other function of the
*  component.
*
* \details
*  This function initializes the component hardware and firmware modules and
*  is called by the application program prior to calling any other API
*  of the component. When this function is called, the following tasks are
*  executed as part of the initialization process:
*    1. Initialize the registers of the \ref group_structures variable
*       `$INSTANCE_NAME`_dsRam based on the user selection in the component
*       configuration wizard.
*    2. Configure the hardware to perform capacitive sensing.
*    3. If SmartSense Auto-tuning is selected for the CSD Tuning mode in the
*       Basic tab, the auto-tuning algorithm is executed to set the optimal
*       values for the hardware parameters of the widgets/sensors.
*    4. Calibrate the sensors and find the optimal values for IDACs of each
*       widget / sensor, if the Enable IDAC auto-calibration is enabled in the
*       CSD Setting or CSX Setting tabs.
*    5. Perform scanning for all the sensors and initialize the baseline history.
*    6. If the firmware filters are enabled in the Advanced General tab, the
*       filter histories are also initialized.

*  Any next call of this API repeats an initialization process except for
*  data structure initialization. Therefore, it is possible to change the
*  component configuration from the application program by writing registers to the
*  data structure and calling this function again. This is also
*  done inside the `$INSTANCE_NAME`_RunTuner() function when a restart command
*  is received.
*
*  When the component operation is stopped by the `$INSTANCE_NAME`_Stop()
*  function, the `$INSTANCE_NAME`_Start() function repeats an initialization
*  process including data structure initialization.
*
* \return
*  Returns the status of the initialization process. If CY_RET_SUCCESS is not
*  received, some of the initialization fails and the component may not operate
*  as expected.
*
*******************************************************************************/
cy_status `$INSTANCE_NAME`_Start(void)
{
    cy_status result;

    /* Initialize `$INSTANCE_NAME` modules */
    result = `$INSTANCE_NAME`_Initialize();

    #if (`$INSTANCE_NAME`_CSD_AUTOTUNE != `$INSTANCE_NAME`_CSD_SS_DIS)
        if (CY_RET_SUCCESS == result)
        {
            result = `$INSTANCE_NAME`_SsAutoTune();
        }
    #endif /* #if (`$INSTANCE_NAME`_CSD_AUTOTUNE != `$INSTANCE_NAME`_CSD_SS_DIS) */

    #if ((0u != `$INSTANCE_NAME`_CSX_IDAC_AUTOCAL_EN) || \
        ((`$INSTANCE_NAME`_CSD_AUTOTUNE == `$INSTANCE_NAME`_CSD_SS_DIS) && (0u != `$INSTANCE_NAME`_CSD_IDAC_AUTOCAL_EN)))
        if (CY_RET_SUCCESS == result)
        {
            result = `$INSTANCE_NAME`_CalibrateAllWidgets();
        }
    #endif

    if (CY_RET_SUCCESS == result)
    {
        result = `$INSTANCE_NAME`_ScanAllWidgets();
    }

    while(`$INSTANCE_NAME`_NOT_BUSY != `$INSTANCE_NAME`_IsBusy()){}

    `$INSTANCE_NAME`_FtInitialize();
    `$INSTANCE_NAME`_InitializeAllBaselines();

    #if (0u != `$INSTANCE_NAME`_ADC_EN)
        `$INSTANCE_NAME`_`$AdcModulePrefix`Initialize();
    #endif /* (0u != `$INSTANCE_NAME`_ADC_EN) */

    return result;
}

