BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_Control.c
/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_Initialize
****************************************************************************//**
*
* \brief
*  This function initializes the `$INSTANCE_NAME` component.
*
* \details
*  This API initializes all sub-modules of the `$INSTANCE_NAME` component:
*   - Data Structure - set the default component parameters defined in the Customizer.
*   - Data Processing - resets all widget statuses.
*   - Tuner - resets tuning state.
*   - Sensing - prepares CSD HW for operation.
*
*  Note that Data Structure module is initialized only once after the reset or
*  `$INSTANCE_NAME`_Stop() API is called. The repeated calls of Initialize API
*  will not re-initialize Data Structure. This is done to preserve component
*  parameters that user may set in runtime.
*
*  If default component parameters are needed the `$INSTANCE_NAME`_DsInitialize()
*  API must be called directly from the application code.
*
* \return
*  Return CY_RET_SUCCESS if the initialization was successful.
*
*******************************************************************************/
cy_status `$INSTANCE_NAME`_Initialize(void)
{
    cy_status result;

    /* The Data Structure and Tuner are initialized only once */
    if (`$INSTANCE_NAME`_INIT_NEEDED == `$INSTANCE_NAME`_InitVar)
    {
        `$INSTANCE_NAME`_DsInitialize();
        `$INSTANCE_NAME`_TuInitialize();
        `$INSTANCE_NAME`_InitVar = `$INSTANCE_NAME`_INIT_DONE;
    }

    `$INSTANCE_NAME`_DpInitialize();

    result = `$INSTANCE_NAME`_SsInitialize();

    return result;
}

/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_Stop
****************************************************************************//**
*
* \brief
*  Stops the component operation.
*
* \details
*  This function stops the component operation, no sensor scanning can be
*  executed when the component is stopped. Once stopped, the hardware block may
*  be reconfigured by the application program for any other special usage. The
*  component operation can be resumed by calling the `$INSTANCE_NAME`_Resume()
*  function or the component can be reset by calling the
*  `$INSTANCE_NAME`_Start() function.
*
*  This function is called when no scanning is in progress.
*  I.e. `$INSTANCE_NAME`_IsBusy() returns a non-busy status.
*
* \return
*  Returns the status of the stop process. If CY_RET_SUCCESS is not received,
*  the stop process fails and retries may be required.
*
*******************************************************************************/
cy_status `$INSTANCE_NAME`_Stop(void)
{
    cy_status result = CY_RET_SUCCESS;

    #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_ADC_EN)
        /* Release CSD resources */
        result = `$INSTANCE_NAME`_SsReleaseResources();

        /* Release ADC resources */
        `$INSTANCE_NAME`_`$AdcCapSensePrefix`Stop();
    #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_ADC_EN) */

    `$INSTANCE_NAME`_InitVar = `$INSTANCE_NAME`_INIT_NEEDED;

    return result;
}

/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_Resume
****************************************************************************//**
*
* \brief
*  Resumes the component operation if the `$INSTANCE_NAME`_Stop() function was
*  called previously.
*
* \details
*  This function resumes the component operation if the operation is stopped
*  previously by the `$INSTANCE_NAME`_Stop() function. The following tasks are
*  executed as part of the operation resume process:
*    1. Reset all the Widgets/Sensors statuses.
*    2. Configure the hardware to perform capacitive sensing.
*
* \return
*  Returns the status of the resume process. If CY_RET_SUCCESS is not received,
*  the resume process fails and retries may be required.
*
*******************************************************************************/
cy_status `$INSTANCE_NAME`_Resume(void)
{
    cy_status result;

    /* The Tuner are initialized only once in order not to break communication */
    if (`$INSTANCE_NAME`_INIT_NEEDED == `$INSTANCE_NAME`_InitVar)
    {
        `$INSTANCE_NAME`_TuInitialize();
        `$INSTANCE_NAME`_InitVar = `$INSTANCE_NAME`_INIT_DONE;
    }
    `$INSTANCE_NAME`_DpInitialize();

    result = `$INSTANCE_NAME`_SsInitialize();

    return result;
}

/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_ProcessAllWidgets
****************************************************************************//**
*
* \brief
*  Performs full data processing of all enabled widgets.
*
* \details
*  This function performs all data processes for all enabled widgets in the
*  component. The following tasks are executed as part of processing all the
*  widgets:
*    1. Apply raw-count filters to the raw counts, if they are enabled in the
*       customizer.
*    2. Update the thresholds if the SmartSense Full Auto-Tuning is enabled in
*       the customizer.
*    3. Update the baselines and difference counts for all the sensors.
*    4. Update the sensor and widget status (on/off), update the centroid for
*       the sliders and the X/Y position for the touchpads.
*
*  Disabled widgets are not processed. To disable/enable a widget, set
*  the appropriate values in the
*  `$INSTANCE_NAME`_WDGT_ENABLE<RegisterNumber>_PARAM_ID register using the
*  `$INSTANCE_NAME`_SetParam() function.
*  This function is called only after all the sensors in the component
*  are scanned. Calling this function multiple times without sensor scanning
*  causes unexpected behavior.
*
*  If the Self-test library is enabled, this function executes the baseline duplication
*  test. Refer to `$INSTANCE_NAME`_CheckBaselineDuplication() for details.
*
* \return
*  Returns the status of the processing operation. If CY_RET_SUCCESS is not received,
*  the processing fails and retries may be required.
*
*******************************************************************************/
cy_status `$INSTANCE_NAME`_ProcessAllWidgets(void)
{
    uint32 wdgtId;
    cy_status result = CY_RET_SUCCESS;
    `$INSTANCE_NAME`_FLASH_WD_STRUCT const *ptrFlashWdgt;

    ptrFlashWdgt = `$INSTANCE_NAME`_dsFlash.wdgtArray;

    for (wdgtId = 0u; wdgtId < `$INSTANCE_NAME`_TOTAL_WIDGETS; wdgtId++)
    {
        if (0uL != `$INSTANCE_NAME`_GET_WIDGET_EN_STATUS(wdgtId))
        {
            switch(`$INSTANCE_NAME`_GET_SENSE_METHOD(ptrFlashWdgt))
            {
            #if (0u != `$INSTANCE_NAME`_TOTAL_CSD_WIDGETS)
                case `$INSTANCE_NAME`_SENSE_METHOD_CSD_E:
                    result = `$INSTANCE_NAME`_DpProcessCsdWidgetRawCounts(ptrFlashWdgt);
                    `$INSTANCE_NAME`_DpProcessCsdWidgetStatus(wdgtId, ptrFlashWdgt);
                    break;
            #endif /* #if (0u != `$INSTANCE_NAME`_TOTAL_CSD_WIDGETS) */

            #if (0u != `$INSTANCE_NAME`_TOTAL_CSX_WIDGETS)
                case `$INSTANCE_NAME`_SENSE_METHOD_CSX_E:
                    result = `$INSTANCE_NAME`_DpProcessCsxWidgetRawCounts(ptrFlashWdgt);
                    `$INSTANCE_NAME`_DpProcessCsxWidgetStatus(wdgtId, ptrFlashWdgt);
                    break;
            #endif /* #if (0u != `$INSTANCE_NAME`_TOTAL_CSX_WIDGETS) */

            default:
                CY_ASSERT(0u);
                break;
            }

            #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_TST_BSLN_DUPLICATION_EN)
                if (CY_RET_SUCCESS != result)
                {
                    `$INSTANCE_NAME`_UpdateTestResultBaselineDuplication(wdgtId, result);
                    result = CY_RET_BAD_DATA;
                }
            #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_TST_BSLN_DUPLICATION_EN) */

