BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_Control.c
        }
        ptrFlashWdgt++;
    }
    return result;
}

/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_ProcessWidget
****************************************************************************//**
*
* \brief
*  Performs full data processing of the specified widget if it is enabled.
*
* \details
*  This function performs exactly the same tasks as
*  `$INSTANCE_NAME`_ProcessAllWidgets(), but only for a specified widget. This
*  function can be used along with the `$INSTANCE_NAME`_SetupWidget() and
*  `$INSTANCE_NAME`_Scan() functions to scan and process data for a specific
*  widget. This function is called only after all the sensors in the
*  widgets are scanned. A disabled widget is not processed by this function.
*
*  The pipeline scan method (i.e. during scanning of a widget perform processing
*  of the previously scanned widget) can be implemented using this function and
*  it may reduce the total scan/process time, increase the refresh rate and
*  decrease the power consumption.
*
*  If the Self-test library is enabled, this function executes the baseline duplication
*  test. Refer to `$INSTANCE_NAME`_CheckBaselineDuplication() for details.
*
* \param widgetId
*  Specifies the ID number of the widget to be processed.
*  A macro for the widget ID can be found in the
*  `$INSTANCE_NAME` Configuration header file defined as
*  `$INSTANCE_NAME`_<WidgetName>_WDGT_ID
*
* \return
*  Returns the status of the widget processing:
*  - CY_RET_SUCCESS - The operation is successfully completed
*  - CY_RET_BAD_PARAM - The input parameter is invalid
*  - CY_RET_INVALID_STATE - The specified widget is disabled
*  - CY_RET_BAD_DATA - The processing is failed
*
*******************************************************************************/
cy_status `$INSTANCE_NAME`_ProcessWidget(uint32 widgetId)
{
    cy_status result = CY_RET_SUCCESS;
    `$INSTANCE_NAME`_FLASH_WD_STRUCT const *ptrFlashWdgt;

    if (widgetId >= `$INSTANCE_NAME`_TOTAL_WIDGETS)
    {
        result = CY_RET_BAD_PARAM;
    }

    if ((CY_RET_SUCCESS == result) && (0uL == `$INSTANCE_NAME`_GET_WIDGET_EN_STATUS(widgetId)))
    {
        result = CY_RET_INVALID_STATE;
    }

    if (CY_RET_SUCCESS == result)
    {
        ptrFlashWdgt = &`$INSTANCE_NAME`_dsFlash.wdgtArray[widgetId];

        switch(`$INSTANCE_NAME`_GET_SENSE_METHOD(ptrFlashWdgt))
        {
        #if (0u != `$INSTANCE_NAME`_TOTAL_CSD_WIDGETS)
            case `$INSTANCE_NAME`_SENSE_METHOD_CSD_E:
                result = `$INSTANCE_NAME`_DpProcessCsdWidgetRawCounts(ptrFlashWdgt);
                `$INSTANCE_NAME`_DpProcessCsdWidgetStatus(widgetId, ptrFlashWdgt);
                break;
        #endif /* #if (0u != `$INSTANCE_NAME`_TOTAL_CSD_WIDGETS) */

        #if (0u != `$INSTANCE_NAME`_TOTAL_CSX_WIDGETS)
            case `$INSTANCE_NAME`_SENSE_METHOD_CSX_E:
                result = `$INSTANCE_NAME`_DpProcessCsxWidgetRawCounts(ptrFlashWdgt);
                `$INSTANCE_NAME`_DpProcessCsxWidgetStatus(widgetId, ptrFlashWdgt);
                break;
        #endif /* #if (0u != `$INSTANCE_NAME`_TOTAL_CSX_WIDGETS) */

        default:
            CY_ASSERT(0u);
            break;
        }

        #if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_TST_BSLN_DUPLICATION_EN)
            if (CY_RET_SUCCESS != result)
            {
                `$INSTANCE_NAME`_UpdateTestResultBaselineDuplication(widgetId, result);
                result = CY_RET_BAD_DATA;
            }
        #endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_TST_BSLN_DUPLICATION_EN) */
    }
    return result;
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_ProcessWidgetExt
****************************************************************************//**
*
* \brief
*  Performs customized data processing on the selected widget.
*
* \details
*  This function performs data processes for the specified widget specified by
*  the mode parameter. The execution order of the requested operations is from
*  LSB to MSB of the mode parameter. For a different order, this API
*  can be called multiple times with the required mode parameter.
*
*  This function can be used with any of the available scan functions. This
*  function is called only after all the sensors in the specified widget are
*  scanned. Calling this function multiple times with the same mode without
*  sensor scanning causes unexpected behavior. This function ignores the value
*  of the wdgtEnable register.
*
*  The `$INSTANCE_NAME`_PROCESS_CALC_NOISE and
*  `$INSTANCE_NAME`_PROCESS_THRESHOLDS flags are supported by the CSD sensing
*  method only when Auto-tuning mode is enabled.
*
*  The pipeline scan method (i.e. during scanning of a widget, processing
*  of a previously scanned widget is performed) can be implemented using this
*  function and it may reduce the total scan/process time, increase the refresh 
*  rate and decrease the power consumption.
*
*  If the Self-test library is enabled, this function executes the baseline duplication
*  test. Refer to `$INSTANCE_NAME`_CheckBaselineDuplication() for details.
*
* \param widgetId
*  Specifies the ID number of the widget to be processed.
*  A macro for the widget ID can be found in the `$INSTANCE_NAME` Configuration header
*  file defined as `$INSTANCE_NAME`_<WidgetName>_WDGT_ID.

* \param mode
*  Specifies the type of widget processing to be executed for the
*  specified widget:
*    1. Bits [31..6] - Reserved.
*    2. Bits [5..0] - `$INSTANCE_NAME`_PROCESS_ALL - Execute all the tasks.
*    3. Bit [5] - `$INSTANCE_NAME`_PROCESS_STATUS - Update the status (on/off,
*       centroid position).
*    4. Bit [4] - `$INSTANCE_NAME`_PROCESS_THRESHOLDS - Update the thresholds
*       (only in CSD auto-tuning mode).
*    5. Bit [3] - `$INSTANCE_NAME`_PROCESS_CALC_NOISE - Calculate the noise (only in
*       CSD auto-tuning mode).
*    6. Bit [2] - `$INSTANCE_NAME`_PROCESS_DIFFCOUNTS - Update the difference counts.
*    7. Bit [1] - `$INSTANCE_NAME`_PROCESS_BASELINE - Update the baselines.
*    8. Bit [0] - `$INSTANCE_NAME`_PROCESS_FILTER - Run the firmware filters.
*
* \return
*  Returns the status of the widget processing operation:
*  - CY_RET_SUCCESS - The processing is successfully performed.
*  - CY_RET_BAD_PARAM - The input parameter is invalid.
*  - CY_RET_BAD_DATA - The processing failed.
*
*******************************************************************************/
cy_status `$INSTANCE_NAME`_ProcessWidgetExt(uint32 widgetId, uint32 mode)
{
    uint32 snsCount;
    cy_status result = CY_RET_BAD_PARAM;
    `$INSTANCE_NAME`_FLASH_WD_STRUCT const *ptrFlashWdgt;
    `$INSTANCE_NAME`_PTR_FILTER_VARIANT fltrHistV;
    `$INSTANCE_NAME`_RAM_SNS_STRUCT *ptrSns;

