BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_Control.c
    }
    return result;
}

/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_Sleep
****************************************************************************//**
*
* \brief
*  Prepares the component for deep sleep.
*
* \details
*  Currently this function is empty and exists as a place for future updates,
*  this function will be used to prepare the component to enter deep sleep.
*
*******************************************************************************/
void `$INSTANCE_NAME`_Sleep(void)
{
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_Wakeup
****************************************************************************//**
*
* \brief
*  Resumes the component after sleep.
*
* \details
*  Resumes the component after sleep. This function shall be used to resume 
*  the component after exiting deep sleep.
*
*******************************************************************************/
void `$INSTANCE_NAME`_Wakeup(void)
{
    #if(`$INSTANCE_NAME`_CSDV2_ANALOG_WAKEUP_DELAY_US > 0uL)
        Cy_SysLib_DelayUs(`$INSTANCE_NAME`_CSDV2_ANALOG_WAKEUP_DELAY_US);
    #endif /* (`$INSTANCE_NAME`_CSDV2_ANALOG_WAKEUP_DELAY_US > 0uL) */
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_DeepSleepCallback
****************************************************************************//**
*
* \brief
*  Handles Active to DeepSleep power mode transition for the `$INSTANCE_NAME`
*  component.
*
* \details
*  This API is registered with system power mode using Cy_SysPm_RegisterCallback()
*  function with CY_SYSPM_DEEPSLEEP type. After registration, this API is called by
*  Cy_SysPm_DeepSleep() to prepare or to check a status of the `$INSTANCE_NAME`
*  component prior the core entering into DeepSleep power mode. 
*
*  Calling this function directly from the application layer is not recommended.
*
*  When this API is called with the mode parameter set to CY_SYSPM_CHECK_READY,
*  the function returns CY_SYSPM_SUCCESS if no scanning is in progress, otherwise 
*  CY_SYSPM_FAIL is returned that means that device cannot enter into DeepSleep 
*  power mode without finishing the current scan that is in progress (transition 
*  to DeepSleep power mode during the scan can disrupt a sensor scan result and 
*  produce an unexpected behaviour after wakeup).
*
* \param callbackParams
*  Refer to the description of the cy_stc_syspm_callback_params_t type.
*
* \return
*  Returns the status of the operation requested by the mode parameter:
*  CY_SYSPM_SUCCESS  - DeepSleep power mode can be entered.
*  CY_SYSPM_FAIL     - DeepSleep power mode cannot be entered.
*
*******************************************************************************/
cy_en_syspm_status_t `$INSTANCE_NAME`_DeepSleepCallback(cy_stc_syspm_callback_params_t *callbackParams)
{
    return(`$INSTANCE_NAME`_SwitchPowerModeCallback(callbackParams));
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_EnterLowPowerCallback
****************************************************************************//**
*
* \brief
*  Handles Active to Low Power Active (LPActive) power mode transition for 
*  the `$INSTANCE_NAME` component.
*
* \details
*  This API is registered with system power mode using Cy_SysPm_RegisterCallback()
*  function with CY_SYSPM_ENTER_LP_MODE type. After registration, this API is called by
*  Cy_SysPm_EnterLpMode() to prepare or to check a status of the `$INSTANCE_NAME`
*  component prior the core entering into LPActive power mode. 
*
*  Calling this function directly from the application layer is not recommended.
*
*  When this API is called with the mode parameter set to CY_SYSPM_CHECK_READY,
*  the function returns CY_SYSPM_SUCCESS if no scanning is in progress, otherwise 
*  CY_SYSPM_FAIL is returned that means that device cannot enter into LPActive 
*  power mode without finishing the current scan that is in progress (transition 
*  to LPActive power mode during the scan can disrupt a sensor scan result and 
*  produce an unexpected behaviour).
*
* \param callbackParams
*  Refer to the description of the cy_stc_syspm_callback_params_t type.
*
* \return
*  Returns the status of the operation requested by the mode parameter:
*  CY_SYSPM_SUCCESS  - LPActive power mode can be entered.
*  CY_SYSPM_FAIL     - LPActive power mode cannot be entered.
*
*******************************************************************************/
cy_en_syspm_status_t `$INSTANCE_NAME`_EnterLowPowerCallback(cy_stc_syspm_callback_params_t *callbackParams)
{
    return(`$INSTANCE_NAME`_SwitchPowerModeCallback(callbackParams));
}


/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_ExitLowPowerCallback
****************************************************************************//**
*
* \brief
*  Handles Low Power Active (LPActive) to Active power mode transition for 
*  the `$INSTANCE_NAME` component.
*
* \details
*  This API is registered with system power mode using Cy_SysPm_RegisterCallback()
*  function with CY_SYSPM_EXIT_LP_MODE type. After registration, this API is called by
*  Cy_SysPm_ExitLpMode() to prepare or to check a status of the `$INSTANCE_NAME`
*  component prior the core exiting from LPActive power mode. 
*
*  Calling this function directly from the application layer is not recommended.
*
*  When this API is called with the mode parameter set to CY_SYSPM_CHECK_READY,
*  the function returns CY_SYSPM_SUCCESS if no scanning is in progress, otherwise 
*  CY_SYSPM_FAIL is returned that means that device cannot exit LPActive 
*  power mode without finishing the current scan that is in progress (transition 
*  from LPActive to Active power mode during the scan can disrupt a sensor scan 
*  result and produce an unexpected behaviour).
*
* \param callbackParams
*  Refer to the description of the cy_stc_syspm_callback_params_t type.
*
* \return
*  Returns the status of the operation requested by the mode parameter:
*  CY_SYSPM_SUCCESS  - Active power mode can be entered.
*  CY_SYSPM_FAIL     - Active power mode cannot be entered.
*
*******************************************************************************/
cy_en_syspm_status_t `$INSTANCE_NAME`_ExitLowPowerCallback(cy_stc_syspm_callback_params_t *callbackParams)
{
    return(`$INSTANCE_NAME`_SwitchPowerModeCallback(callbackParams));
}


