BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_Control.c
/*******************************************************************************
* Function Name: `$INSTANCE_NAME`_SwitchPowerModeCallback
****************************************************************************//**
*
* \brief
*  Handles the switching power mode for the `$INSTANCE_NAME` component.
*
* \details
*  This function handles swithing of system power mode.
*  When this API is called with the mode parameter set to CY_SYSPM_CHECK_READY,
*  the function returns CY_SYSPM_SUCCESS if no scanning is in progress, otherwise 
*  CY_SYSPM_FAIL is returned that means that device cannot switch power mode 
*  without finishing the current scan that is in progress (switching power mode 
*  during the scan can disrupt a sensor scan result and produce an unexpected
*  behaviour).
*
* \param callbackParams
*  Refer to the description of the cy_stc_syspm_callback_params_t type.
*
* \return
*  Returns the status of the operation requeted by mode parameter:
*  CY_SYSPM_SUCCESS  - Switching power mode can be done
*  CY_SYSPM_FAIL     - Switching power mode cannot be done.
*
*******************************************************************************/
static cy_en_syspm_status_t `$INSTANCE_NAME`_SwitchPowerModeCallback(cy_stc_syspm_callback_params_t *callbackParams)
{
    cy_en_syspm_status_t retVal = CY_SYSPM_SUCCESS;

    #if (0u != `$INSTANCE_NAME`_ADC_EN)
        uint8 temp;
    #endif /* (0u != `$INSTANCE_NAME`_ADC_EN) */
    
    switch(callbackParams->mode)
    {
    case (CY_SYSPM_CHECK_READY):
        if (`$INSTANCE_NAME`_NOT_BUSY != `$INSTANCE_NAME`_IsBusy())
        {
            /* Scanning in progress */
            retVal = CY_SYSPM_FAIL;
        }
        #if (0u != `$INSTANCE_NAME`_ADC_EN)
            temp = `$INSTANCE_NAME`_`$AdcModulePrefix`IsBusy();
            if ((`$INSTANCE_NAME`_`$AdcModulePrefix`STATUS_IDLE != temp) &&
                (`$INSTANCE_NAME`_`$AdcModulePrefix`STATUS_OVERFLOW != temp))
            {
                /* Scanning in progress */
                retVal = CY_SYSPM_FAIL;
            }
        #endif /* (0u != `$INSTANCE_NAME`_ADC_EN) */
        break;

    default:
        break;
    }

    return(retVal);
}


/* [] END OF FILE */
